#include "pch.h"
#include <clocale>
#include "iostream"

using namespace std;


/*¬аш космический корабль потерпел крушение на пустынной планете.
≈да здесь не растЄт, но вы спасли из-под обломков 100-килограммовый мешок гречки.
»з прошлого опыта вы знаете, что если будете экономно питатьс€, то у вас будет уходить по четыре килограмма гречки в мес€ц.
„тобы прикинуть гречневый бюджет, вы решили написать программу, котора€ выведет информацию о том,
сколько килограммов гречки у вас должно быть в запасе через мес€ц, два и так далее, пока она не закончитс€.*/

void task1() {
	cout << "task1";
}