#include "pch.h"
#include <clocale>
#include "iostream"

using namespace std;


/*Напишите программу для печати важных объявлений.*/
void task6() {
	cout << "task6";
}