#include "pch.h"
#include <clocale>
#include "iostream"

using namespace std;


/*Напишите программу, которая рисует с помощью символьной графики прямоугольную рамку.
Для вертикальных линий используйте символ вертикального штриха «|»,
а для горизонтальных — дефис «-». Пусть пользователь вводит ширину и высоту рамки.*/
void task4() {
	cout << "task4";
}